In [ ]:
print("Hello Pandas - Missing Data!")

Hello Pandas - Missing Data!

In [ ]:
import numpy as np 
import pandas as pd

In [ ]:
d = {'A':[1,2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1,2,3]}

In [ ]:
df = pd.DataFrame(d)

In [ ]:
# Row '0' has no missing Values, and Column 'C' has no missing values 
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

## Dropping Rows w/ Missing Values (dropna)

In [ ]:
df.dropna()

     A    B  C
0  1.0  5.0  1

Dropping Columns w/ Missing Values

In [ ]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

## Specifying a Threshold

In [ ]:
# If We set the threshold to be equal to 2 and run this will went ahead and kept row 1 and 2, because it has a maximum of 2 Nan values
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

## Filling in Missing Values (fillna)

In [ ]:
# Again, here is my DF:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
df.fillna(value = "Fill Value")

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [ ]:
# Or to the mean of the column
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [ ]:
# https://medium.com/jungletronics/pandas-missing-data-5142f3eda2b
print("Thank you for Reading This post! See you soon! Bye o/")

Thank you for Reading This post! See you soon! Bye o/